# This facilitates brew's autoupdate behaviors
tap "domt4/autoupdate"
tap "hashicorp/tap"
# Open Policy registry... not sure why i have this
tap "opcr-io/tap"

# AWS cli
brew "awscli"
# granted.dev
brew "common-fate/granted/granted"
# Bootstrap: set firefox as default browser
brew "defaultbrowser"
# Git: Diff tool for my custom git configs
brew "delta"
# Bootstrap: manage mac desktop doc settings 
brew "dockutil"
# FluxCD CLI
brew "fluxcd/tap/flux"
# Shell: fuzzy matcherused by a lot of tools like assume and kubectx
brew "fzf"
# GitHub CLI
brew "gh"
# Newer git than MacOS provides
brew "git"
# Helm Chart CLI
brew "helm"
# JQ cli tool for working with json
brew "jq"
# Kubernetes cli tooling
brew "kubectl"
brew "kubectx"
brew "kustomize"
# Newer nano than MacOS provides (they actually use a new pico, and link it. ew)
brew "nano"
# Oh My Posh Prompt manager
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# A OCI compliance container engine setup
brew "podman"
brew "podman-compose"
# Install Pulumi CLI
brew "pulumi/tap/pulumi"
# Install the actual terraform package from hashicorp
brew "hashicorp/tap/terraform"
# mikefarah's YQ cli tool for working with yaml
brew "yq"

cask "1password-cli"
cask "firefox"
cask "ghostty"
cask "gcloud-cli"
cask "google-chrome"
cask "logi-options+"
cask "notion"
cask "notion-calendar"
cask "podman-desktop"
cask "rectangle"
cask "slack"
cask "tailscale-app"
cask "zoom"

vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "vivaxy.vscode-conventional-commits"
vscode "yzhang.markdown-all-in-one"
