tap "hashicorp/tap"
tap "opcr-io/tap"
brew "cmake", link: false
brew "delta"
brew "gh"
brew "git"
brew "jq"
brew "nano"
brew "podman"
brew "podman-compose"
brew "yadm"
brew "yq"
brew "hashicorp/tap/terraform"
cask "1password-cli"
cask "ghostty"
cask "podman-desktop"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "vivaxy.vscode-conventional-commits"
vscode "yzhang.markdown-all-in-one"
